In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.arange(24).reshape((6,4)),index=dates, columns=['A','B','C','D'])

In [3]:
df

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [11]:
df['A']  
# df.A

2013-01-01     0
2013-01-02     4
2013-01-03     8
2013-01-04    12
2013-01-05    16
2013-01-06    20
Freq: D, Name: A, dtype: int32

In [12]:
df[0:3]

            A  B   C   D
2013-01-01  0  1   2   3
2013-01-02  4  5   6   7
2013-01-03  8  9  10  11

In [13]:
df['20130102':'20130104']

             A   B   C   D
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15

# select by label: loc

In [14]:
df.loc['20130102']

A    4
B    5
C    6
D    7
Name: 2013-01-02 00:00:00, dtype: int32

In [15]:
df.loc[:,['A','B']]

             A   B
2013-01-01   0   1
2013-01-02   4   5
2013-01-03   8   9
2013-01-04  12  13
2013-01-05  16  17
2013-01-06  20  21

In [16]:
df.loc['20130102',['A','B']]

A    4
B    5
Name: 2013-01-02 00:00:00, dtype: int32

# select by position: iloc

In [17]:
df.iloc[3]

A    12
B    13
C    14
D    15
Name: 2013-01-04 00:00:00, dtype: int32

In [18]:
df.iloc[3,1]

13

In [19]:
df.iloc[3:5, 1:3]

             B   C
2013-01-04  13  14
2013-01-05  17  18

In [20]:
df.iloc[[1,3,5], 1:3]

             B   C
2013-01-02   5   6
2013-01-04  13  14
2013-01-06  21  22

# Boolean indexing

In [25]:
df[df.A>8]  # 根据A是否大于8进行筛选

             A   B   C   D
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23